thibautldz/BLE_Scanner/STM32_WPAN/App/app_ble.c
/* Private function prototypes -----------------------------------------------*/
static void BLE_UserEvtRx( void * pPayload );
static void BLE_StatusNot( HCI_TL_CmdStatus_t status );
static void Ble_Tl_Init( void );
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGetBdAddress( void );
static void Scan_Request( void );
static void Connect_Request( void );
static void Connect_Request_Selected_Addr( void );
static void Switch_OFF_GPIO( void );
static void rx_usartCallBack( void );
static void start_timer( void );
static uint8_t contains_address(uint8_t * newAdd, uint8_t structure);
/* USER CODE BEGIN PFP */
static void rx_usartCallBack( void )
{
	UTIL_SEQ_SetTask(1<<CFG_TASK_CONN_DEV_SELECT_ID, CFG_PRIO_NBR);
}

static uint8_t contains_address(uint8_t * newAdd, uint8_t structure)// 0 -> scan_report / 1-> scan_report_name
{
	uint8_t ret = 0;
		for(int i = 0; i < index_tab ; i++)
        {
			if(structure == 0)
			{
        		  if(  newAdd[0] == scan_report->ScanAddr[i][0]
				    && newAdd[1] == scan_report->ScanAddr[i][1]
				    && newAdd[2] == scan_report->ScanAddr[i][2]
				    && newAdd[3] == scan_report->ScanAddr[i][3]
				    && newAdd[4] == scan_report->ScanAddr[i][4]
				    && newAdd[5] == scan_report->ScanAddr[i][5])
        	        {
        			  ret = 1;
        	        }
			}
			else if (structure == 1)
			{
				 if(  newAdd[0] == scan_report_naming->ScanAddr[i][0]
				   && newAdd[1] == scan_report_naming->ScanAddr[i][1]
				   && newAdd[2] == scan_report_naming->ScanAddr[i][2]
				   && newAdd[3] == scan_report_naming->ScanAddr[i][3]
				   && newAdd[4] == scan_report_naming->ScanAddr[i][4]
				   && newAdd[5] == scan_report_naming->ScanAddr[i][5])
				   {
				      ret = 1;
				   }
			}
        }
		return ret;
}

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init( void )
{
/* USER CODE BEGIN APP_BLE_Init_1 */

/* USER CODE END APP_BLE_Init_1 */
  SHCI_C2_Ble_Init_Cmd_Packet_t ble_init_cmd_packet =
  {
    {{0,0,0}},                          /**< Header unused */
    {0,                                 /** pBleBufferAddress not used */
    0,                                  /** BleBufferSize not used */
    CFG_BLE_NUM_GATT_ATTRIBUTES,
    CFG_BLE_NUM_GATT_SERVICES,
    CFG_BLE_ATT_VALUE_ARRAY_SIZE,
    CFG_BLE_NUM_LINK,
    CFG_BLE_DATA_LENGTH_EXTENSION,
    CFG_BLE_PREPARE_WRITE_LIST_SIZE,
    CFG_BLE_MBLOCK_COUNT,
    CFG_BLE_MAX_ATT_MTU,
    CFG_BLE_SLAVE_SCA,
    CFG_BLE_MASTER_SCA,
    CFG_BLE_LSE_SOURCE,
    CFG_BLE_MAX_CONN_EVENT_LENGTH,
    CFG_BLE_HSE_STARTUP_TIME,
    CFG_BLE_VITERBI_MODE,
    CFG_BLE_LL_ONLY,
    0}
  };

  /**
   * Initialize Ble Transport Layer
   */
  Ble_Tl_Init( );

  /**
   * Do not allow standby in the application
   */
  UTIL_LPM_SetOffMode(1 << CFG_LPM_APP_BLE, UTIL_LPM_DISABLE);

/**
   * Register the hci transport layer to handle BLE User Asynchronous Events
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_HCI_ASYNCH_EVT_ID, UTIL_SEQ_RFU, hci_user_evt_proc);

  /**
   * Starts the BLE Stack on CPU2
   */
  SHCI_C2_BLE_Init( &ble_init_cmd_packet );

  /**
   * Initialization of HCI & GATT & GAP layer
   */
  Ble_Hci_Gap_Gatt_Init();

  /**
   * Initialization of the BLE Services
   */
  SVCCTL_Init();

  /**
   * From here, all initialization are BLE application specific
   */
  UTIL_SEQ_RegTask( 1<<CFG_TASK_START_SCAN_ID, UTIL_SEQ_RFU, Scan_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_1_ID, UTIL_SEQ_RFU, Connect_Request);
  UTIL_SEQ_RegTask( 1<<CFG_TASK_CONN_DEV_SELECT_ID, UTIL_SEQ_RFU, Connect_Request_Selected_Addr);

  /**
   * Initialization of the BLE App Context
   */

      BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

    /*Radio mask Activity*/
#if (OOB_DEMO != 0)
  aci_hal_set_radio_activity_mask(0x0020);
#endif
  /**
   * Initialize P2P Client Application
   */
  P2PC_APP_Init();

#if (OOB_DEMO != 0)
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &(BleApplicationContext.SwitchOffGPIO_timer_Id), hw_ts_SingleShot, Switch_OFF_GPIO);
#endif

#if (OOB_DEMO == 0)
  /**
   * Start scanning
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
#endif
/* USER CODE BEGIN APP_BLE_Init_2 */

/* USER CODE END APP_BLE_Init_2 */
  return;
}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification( void *pckt )
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blue_aci *blue_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;
  uint8_t result;
  uint8_t event_type, event_data_size;
  uint8_t adtype, adlength;

  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */

    /* USER CODE END evt */
    case EVT_VENDOR:
    {
      handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
      blue_evt = (evt_blue_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (blue_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */

        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        {
        /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

        /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blue_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
              && gap_evt_proc_complete->Status == 0x00)
          {
            /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */
            BSP_LED_Off(LED_BLUE);
            /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// This part of the code find if a report_name match with an addr, if yes, the name is put in the array SCANNING_NAME
// After, it's just for the layout for the terminal
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
            for(int i = 0; i < INDEX_FOUND ; i++)
            {
            	for(int y = 0 ; y < index_tab ; y++)
            	{
				   if( scan_report_naming->ScanAddr[i][0] == scan_report->ScanAddr[y][0]
					&& scan_report_naming->ScanAddr[i][1] == scan_report->ScanAddr[y][1]
					&& scan_report_naming->ScanAddr[i][2] == scan_report->ScanAddr[y][2]
					&& scan_report_naming->ScanAddr[i][3] == scan_report->ScanAddr[y][3]
					&& scan_report_naming->ScanAddr[i][4] == scan_report->ScanAddr[y][4]
					&& scan_report_naming->ScanAddr[i][5] == scan_report->ScanAddr[y][5])
					{
					   for (int a = 0 ; a < MAX_ADV_DATA_LEN ; a++)
					   {
						   scan_report->ScanDATA[y][a] = scan_report_naming->ScanDATA[i][a];
					   }
					}
            	}
            }



            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n\r\n\r\n\r");
            APP_DBG_MSG("\t\t\t\t\t\t  ------------------\n\r");
            APP_DBG_MSG("\t\t\t\t\t\t||REPORT BLE SCANNER||\n\r");
            APP_DBG_MSG("\t\t\t\t\t\t  ------------------\n\r\n\r");
            APP_DBG_MSG(" N | \t\t\t     NAME   \t\t\t  |      \t ADDRESS \t    |      RSSI      |\n\r");

            for(int j = 0; j < index_tab ; j++)
            {
            	if (scan_report->ScanDATA[j] == 0)
            	{
            		break;
            	}
            	APP_DBG_MSG("%2d |", j);
            	APP_DBG_MSG("%30s                        |   ", scan_report->ScanDATA[j]);
            	for (int k = 5; k >= 0; k--)
            	{
            		APP_DBG_MSG("%02X   ", scan_report->ScanAddr[j][k]);
            	}
            	APP_DBG_MSG("|    %4i dBm    ", scan_report->ScanRSSI[j]);
            	APP_DBG_MSG("|\n\r");
            }
            index_tab_save = index_tab;
            index_tab = 0;
            INDEX_FOUND = 0;

